trunk/src/EschoolinkWebApp/src/conf/xml-resources/web-service-references/test/wsdl/sanchikaro_18001/EShoolinkComApp-sun-http-binding/QuanLyHocSinh/interface_WSDL/newWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="newWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/QuanLyHocSinh/newWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/QuanLyHocSinh/newWSDL" xmlns:ns="http://xml.netbeans.org/schema/EschoolinkObject" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/QuanLyHocSinh/newWSDL">
            <xsd:import namespace="http://xml.netbeans.org/schema/EschoolinkObject" schemaLocation="../XSD_XML_Object/EschoolinkObject.xsd"/>
        </xsd:schema>
    </types>
    <message name="newWSDLOperationRequest">
        <part name="part1" element="ns:Truong"/>
    </message>
    <message name="newWSDLOperationResponse">
        <part name="part1" element="ns:Truong"/>
    </message>
    <portType name="newWSDLPortType">
        <operation name="newWSDLOperation">
            <input name="input1" message="tns:newWSDLOperationRequest"/>
            <output name="output1" message="tns:newWSDLOperationResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="newWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="newWSDLPortTypeRole" portType="tns:newWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>

