src/EShoolinkComApp/test/results/TestOject/Actual_20100721100914_F.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Truong xmlns="http://xml.netbeans.org/schema/EschoolinkObject" xmlns:esc="http://xml.netbeans.org/schema/EschoolinkObject" xmlns:msgns="http://j2ee.netbeans.org/wsdl/QuanLyHocSinh/newWSDL">
      <esc:id>1</esc:id>
      <esc:tenTruong>asdad</esc:tenTruong>
      <esc:diaChiTruong>asada</esc:diaChiTruong>
      <esc:ngayThanhLapTruong>2008-09-29</esc:ngayThanhLapTruong>
      <esc:loaiHinhTruong>sdfsfs</esc:loaiHinhTruong>
      <esc:dienThoaiTruong>21</esc:dienThoaiTruong>
      <esc:websiteTruong>asdsfs</esc:websiteTruong>
      <esc:gioiThieuTruong>dsfsfsfsfsfsf</esc:gioiThieuTruong>
    </Truong>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>